Namespace:   Autodesk.Revit.UI.Macros
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override List<RibbonPanel> GetRibbonPanels()
  Visual Basic
Public Overrides Function GetRibbonPanels As List(Of RibbonPanel)
  Visual C++
public:
virtual List<RibbonPanel^>^ GetRibbonPanels() override
 See Also
  ApplicationEntryPoint Class
  GetRibbonPanels Overload
  Autodesk.Revit.UI.Macros Namespace